## Plan Result (543: demo_frontdoor - TerraformPlanApply)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 1 to change, 2 to destroy.</code></pre>

* Update
  * module.premium_front_door.azapi_update_resource.frontdoor_system_identity
* Replace
  * module.premium_front_door.azurerm_key_vault_access_policy.frontdoor_premium_kv_access[0]
  * module.premium_front_door.azurerm_role_assignment.frontdoor_premium_kv_access[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.premium_front_door.azapi_update_resource.frontdoor_system_identity will be updated in-place
  ~ resource "azapi_update_resource" "frontdoor_system_identity" {
      ~ body                    = jsonencode(
          ~ {
              ~ identity = {
                  ~ type = "None" -> "SystemAssigned"
                }
            }
        )
        id                      = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo"
        name                    = "sdshmcts-demo"
      ~ output                  = jsonencode({}) -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_key_vault_access_policy.frontdoor_premium_kv_access[0] must be replaced
-/+ resource "azurerm_key_vault_access_policy" "frontdoor_premium_kv_access" {
      ~ id                      = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/sds-platform-demo-rg/providers/Microsoft.KeyVault/vaults/acmedtssdsdemo/objectId/0f38f358-9adb-453f-b0a4-e436f175402c" -> (known after apply)
      ~ object_id               = "0f38f358-9adb-453f-b0a4-e436f175402c" -> (known after apply) # forces replacement
      - storage_permissions     = [] -> null
      ~ tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_role_assignment.frontdoor_premium_kv_access[0] must be replaced
-/+ resource "azurerm_role_assignment" "frontdoor_premium_kv_access" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/sds-platform-demo-rg/providers/Microsoft.KeyVault/vaults/acmedtssdsdemo/providers/Microsoft.Authorization/roleAssignments/a4cebba5-443d-a159-c585-d3bdce4e6f13" -> (known after apply)
      ~ name                                   = "a4cebba5-443d-a159-c585-d3bdce4e6f13" -> (known after apply)
      ~ principal_id                           = "0f38f358-9adb-453f-b0a4-e436f175402c" -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.premium_front_door.azapi_update_resource.frontdoor_system_identity has changed
  ~ resource "azapi_update_resource" "frontdoor_system_identity" {
        id                      = "/subscriptions/c68a4bed-4c3d-4956-af51-4ae164c1957c/resourceGroups/lz-demo-rg/providers/Microsoft.Cdn/profiles/sdshmcts-demo"
        name                    = "sdshmcts-demo"
      ~ output                  = jsonencode(
          ~ {
              - identity = {
                  - principalId = "0f38f358-9adb-453f-b0a4-e436f175402c"
                  - tenantId    = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
                }
            }
        )
        # (7 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":999,"Program":"tfcmt","SHA1":"","Target":"543: demo_frontdoor - TerraformPlanApply","Vars":{}} -->